tap "homebrew/bundle"

brew "gcc"
brew "libressl"
brew "openssh"
brew "git"

tap "homebrew/cask"
tap "homebrew/cask-versions"

brew "coreutils"
brew "tldr"
brew "zsh"
brew "z"
brew "asdf"
brew "gnupg"

cask "rectangle"
cask "keepingyouawake"
cask "firefox"

cask "iterm2"
cask "docker"
cask "visual-studio-code"
cask "insomnia"

cask "ferdi"
cask "notion"
cask "obsidian"

cask "gimp"
cask "blender"

cask "1password"
cask "authy"
cask "keepassxc"

cask "expressvpn"

cask "zoom"
cask "obs"
cask "farrago"

tap "homebrew/cask-fonts"
cask "font-hack"
cask "font-fira-code"
cask "font-bitter"
cask "font-inter"

tap "homebrew/cask-drivers"
cask "logitech-options"
cask "wacom-tablet"

brew "mas"
mas "XCode", id: 497799835
