tap "homebrew/bundle"

brew "gcc"
brew "libressl"
brew "openssh"
brew "git"

tap "homebrew/cask"
tap "homebrew/cask-versions"

brew "coreutils"
brew "tldr"
brew "zsh"
brew "z"
brew "asdf"
brew "gnupg"
brew "tree"
brew "btop"

cask "rectangle"
cask "keepingyouawake"
cask "firefox"
cask "brave-browser"

cask "iterm2"
cask "visual-studio-code"
cask "insomnia"
cask "charles"

brew "colima"
brew "docker"
brew "docker-compose"

tap "ferdium/ferdium"
cask "ferdium/ferdium/ferdium"

cask "gimp"
cask "blender"

cask "1password"
cask "authy"
cask "keepassxc"

cask "nordvpn"

cask "zoom"
cask "obs"
cask "farrago"
cask "elgato-camera-hub"
cask "elgato-stream-deck"

tap "homebrew/cask-fonts"
brew "svn"
cask "font-hack"
cask "font-fira-code"
cask "font-bitter"
cask "font-inter"
cask "font-playfair-display"

tap "homebrew/cask-drivers"
cask "logi-options-plus"
cask "wacom-tablet"

brew "mas"
mas "XCode", id: 497799835
mas "Horo - Timer for Menu Bar", id: 1437226581

# cask "android-studio" # groups: :android :reactnative
# cask "android-commandlinetools" # groups: :android :reactnative
# cask "vysor" # groups: :android :ios :reactnative

# brew "watchman" # groups: :reactnative
# cask "react-native-debugger" # groups: :reactnative
