brew "gcc"
brew "libressl"
brew "openssh"
brew "git"

tap "homebrew/cask"

brew "coreutils"
brew "tldr"
brew "zsh"
brew "z"
brew "asdf"
brew "gpg"

cask "firefox"
cask "iterm2"
cask "rectangle"
cask "docker"
cask "keepingyouawake"
cask "visual-studio-code"
cask "gimp"

cask "1password"
cask "authy"
cask "nordvpn"

cask "google-chat"
cask "slack"
cask "zoomus"

tap "homebrew/cask-fonts"
cask "font-hack"

tap "homebrew/cask-drivers"
cask "logitech-options"

brew "mas"
mas "XCode", id: 497799835
