##### VS Code + Plugins
cask "visual-studio-code"

# Base plugins
vscode "editorconfig.editorconfig"
vscode "mikestead.dotenv"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "eamodio.gitlens"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-australian-english"
vscode "github.copilot"
vscode "github.copilot-chat"


# File utils
vscode "patbenatar.advanced-new-file"
vscode "sleistner.vscode-fileutils"
vscode "roscop.activefileinstatusbar"

# Markdown utils
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "yzhang.markdown-all-in-one"

# Converters
vscode "adamhartford.vscode-base64"
vscode "espresso3389.unixtime-converter"
vscode "hilleer.yaml-plus-json"


# Languages / Filetypes
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-containers"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "tamasfe.even-better-toml"

# Frameworks
vscode "hverlin.mise-vscode"
vscode "denoland.vscode-deno"
vscode "astro-build.astro-vscode"
