# Newer versions of core utilities that aren't bundled with MacOS
brew "gcc"
brew "libressl"
brew "openssh"
brew "coreutils"
brew "gnupg"
brew "zsh"
brew "zoxide"
brew "fzf"
brew "svn" # Needed for some fonts

cask "bruno"

# Useful Utils
brew "tldr"
brew "tree"
brew "jq"
brew "btop"

tap "pkgxdev/made"
brew "pkgxdev/made/pkgx"
